


*** 10 generate working directory

#+HEADERS: :results raw
#+HEADERS: :dir /su::/tmp
#+BEGIN_SRC sh

mkdir gentoo

du -hd1 .  | grep gentoo

#+END_SRC

mkdir /tmp/gentoo

mount -o size=90%,noatime,nodiratime,mode=777 -t tmpfs tmpfs /tmp/gentoo

mount | grep gentoo


#+HEADERS: :results raw
#+HEADERS: :dir /su::/tmp
#+BEGIN_SRC sh

mkdir gentoo

mount -o size=90%,noatime,nodiratime,mode=777 -t tmpfs tmpfs /tmp/gentoo

du -hd1 .  | grep gentoo

mount | grep gentoo

#+END_SRC

#+RESULTS:
0	./gentoo
tmpfs on /tmp/gentoo type tmpfs (rw,noatime,nodiratime,size=5397036k,mode=777)


*** 20 extract 2 big files


#+HEADERS: :results raw
#+HEADERS: :dir /su::/tmp/gentoo
#+BEGIN_SRC sh

pwd

ls /mnt/fs1/stage3*

ls /mnt/fs1/portage*

#+END_SRC

#+RESULTS:
/tmp/gentoo
/mnt/fs1/stage3-amd64-hardened-20160331.tar.bz2
/mnt/fs1/stage3-amd64-hardened-20160407.tar.bz2
/mnt/fs1/portage-20160405.tar.xz




*** 10 generate working directory

#+HEADERS: :results raw
#+HEADERS: :dir /su::/tmp
#+BEGIN_SRC sh

mkdir gentoo

du -hd1 .  | grep gentoo

#+END_SRC

#+RESULTS:
0	./gentoo
0	./gentoo



*** 20 extract 2 big files


#+HEADERS: :results raw
#+HEADERS: :dir /su::/tmp/gentoo
#+BEGIN_SRC sh

pwd

ls /mnt/fs1/stage3*

ls /mnt/fs1/portage*

#+END_SRC

#+RESULTS:
/tmp/gentoo
/mnt/fs1/stage3-amd64-hardened-20160331.tar.bz2
/mnt/fs1/portage-20160405.tar.xz


***** btrfs subvolume

http://www.grymoire.com/Unix/sed.html

#+HEADERS: :results raw
#+BEGIN_SRC sh

  mount  | awk '$3 ~ /^\/$/ {print $NF}' | sed 's/.*subvol=\/\(.*\))/\1/'
# mount  | awk '$3 ~ /^\/$/ {print $NF}' | sed 's/.*subvol=\/\(.*\)/\1/'

# mount | awk '$3 ~ /^\/$/ {print $NF}' # | awk 'BEGIN{ FS="[,]"} {print $NF}'  
# mount | awk '$3 ~ /^\/$/ {print $NF}' # | awk 'BEGIN{ FS="[,]"} {print $NF}'  

#+END_SRC

#+RESULTS:
fs2/snapshot20160210
fs2/snapshot20160210)
(rw,noatime,compress=lzo,noacl,space_cache,autodefrag,inode_cache,subvolid=263,subvol=/fs2/snapshot20160210)
(rw,noatime,compress=lzo,noacl,space_cache,autodefrag,inode_cache,subvolid=263,subvol=/fs2/snapshot20160210)

***** root device

#+HEADERS: :results raw
#+BEGIN_SRC sh

mount | awk '$3 ~ /^\/$/ {print $1}' | awk 'BEGIN{ FS="[/]"} {print $3}'

#  mount #| awk '$3 ~ /^\/$/ {print $1}'   | awk 'BEGIN{ FS="[/]"} {print $3}'
#  mount  | awk '$3 ~ /^\/$/ {print $1}' # | awk 'BEGIN{ FS="[/]"} {print $3}'
#  mount  | awk '$3 ~ /^\/$/ {print $1}'   | awk 'BEGIN{ FS="[/]"} {print $3}'

#+END_SRC

#+RESULTS:
sdb



